app/views/tasks/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."task_id" = ?  [["task_id", 1]]
---
      <td><%= task.text %></td>
      <td><%= raw task.tags.map(&:name).map{|tag| link_to tag, tag_path(tag)}.join(", ") %></td>