app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "task1"], ["text", "sdf"], ["created_at", "2019-01-09 16:55:46.630280"], ["updated_at", "2019-01-09 16:55:46.630280"]]
---
	def create
		@task = Task.new(task_params)

		if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "text" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["text", "work, recreation"], ["updated_at", "2019-01-09 08:20:46.382499"], ["id", 1]]
---
	def update
		@task = Task.find(params[:id])

		if @task.update(task_params)

SELECT "tasks".* FROM "tasks" INNER JOIN "taggings" ON "tasks"."id" = "taggings"."task_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 2]]
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."task_id" = ?  [["task_id", 3]]
---
  	def tagged
  		if params[:tag].present?
  			@tasks = Task.tagged_with(params[:tag])
  		else
  			@tasks = Task.all