app/models/task.rb

	def self.tagged_with(name)
		Tag.find_by!(name: name).tasks
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["name", "work"], ["LIMIT", 1]]

	def tag_list=(names)
		self.tags = names.split(",").map do |name|
			Tag.where(name: name.strip).first_or_create!
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."task_id" = ?  [["task_id", 4]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "taggg"], ["created_at", "2019-01-23 09:55:48.995794"], ["updated_at", "2019-01-23 09:55:48.995794"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["name", "taggg"], ["LIMIT", 1]]

	def tag_list
		self.tags.map(&:name).join(", ")
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."task_id" = ?  [["task_id", 4]]

	def tag_links
		self.tags.map(&:name).map{|tag| link_to tag, tag_path(tag)}.join(", ")
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."task_id" = ?  [["task_id", 1]]